%% 游戏升级问题
clc,clear;
f = [-20;-30;-40];
intcon = [1,2,3]
A = [4 8 10; 1 1 1];
b = [100; 20];
lb = zeros(3,1);
[x,fval] = intlinprog(f,intcon,A,b,[],[],lb)
y = -fval
disp('A、B、C三张地图分别通关的次数为：')
disp(x);
disp('最终获得的经验为：')
disp(y);

%% 背包问题
clc,clear;
c = -[540 200 180 350 60 150 280 450 320 120];
intcon = [1:10];
A = [6 3 4 5 1 2 3 5 4 2]; b = 30;
Aeq = []; beq = [];
lb = zeros(10,1);
ub = ones(10,1);
[x,fval] = intlinprog(c,intcon,A,b,Aeq,beq,lb,ub)
fval = -fval
disp('利润最大值为：')
disp(fval)

%% 指派问题
clc,clear;
% 双下标要转换为单下标：x11->x1,x12->x2,...,x24->x8,...,x54->x20
c = [66.8 75.6 87 58.6 57.2 66 66.4 53 78 67.8 84.6 59.4 70 74.2 69.6 57.2 67.4 71 83.8 62.4]';
intcon = [1:20];
% 每个人最多只能入选一种泳姿，一共5个线性不等式约束
A = [1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;
     0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0;
     0 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 0;
     0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0;
     0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1];
b = ones(5,1);
% 每种泳姿都有且只能有一个人入选，一共4个线性等式约束
Aeq = [1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0;
       0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0;
       0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0;
       0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1];
% 亦可Aeq = [eye(4),eye(4),eye(4),eye(4)]，用四个单位矩阵拼接
beq = ones(4,1);
lb = zeros(20,1);
ub = ones(20,1);
[x,fval] = intlinprog(c,intcon,A,b,Aeq,beq,lb,ub)
% reshape(x,4,5)'      (想要优先行排序，后面必须加转置符号。Matlab默认是优先列排序的)
%      0     0     0     1     甲自由泳
%      1     0     0     0     乙蝶泳
%      0     1     0     0     丙仰泳
%      0     0     1     0     丁蛙泳
%      0     0     0     0     戊不参加
reshape(x,4,5)'
disp('整个接力队伍完成时间为：')
disp(fval);
