% a矩阵的元素是不同风险率，从0到0.05等差取值，相邻两个数相差0.001
a = (0:0.001:0.05);
f = [-0.05,-0.27,-0.19,-0.185,-0.185];
% A是不等式约束条件的变量系数构成的矩阵
% 用zeros(4,1)构造4行1列的全是0的矩阵，也就是对x_0无约束
% 再构造对角矩阵diag([0.025,0.015,0.055,0.026])
A = [zeros(4,1),diag([0.025,0.015,0.055,0.026])];
Aeq = [1,1.01,1.02,1.045,1.065];    % 等式约束的系数矩阵，也就是所有资产投资
beq = 1;
lb = zeros(5,1);
Q = zeros(1,length(a));    % 初始化保存最优解的矩阵Q，因为现在还没求出最优解，元素全设为0
XX = [];
% 利用矩阵Q存储风险率a(i)下最大的收益：for循环中i在变化，风险率a(i)不同，求出对应的最优解存在矩阵Q内
for i = 1:length(a)
    b = a(i)*ones(4,1);
    [x,y] = linprog(f,A,b,Aeq,beq,lb);
    Q(i) = -y;
    XX = [XX;x'];
end
plot(a,Q,'*r');
xlabel('风险率');
ylabel('最大收益');